In [4]:
# Chapter 7; 데이터 정제 및 준비

In [5]:
# 이 장에서는 결측치, 중복 데이터, 문자열 처리 그리고 다른 분석적 데이터 변환에 대한 도구들을 다룬다.

In [6]:
# 다음 장에서는 데이터를 합치고 재배열하는 다양한 방법을 알아보겠다.

In [7]:
# 7.1 누락된 데이터 처리하기

In [8]:
# 누락된 데이터를 처리하는 일은 데이터 분석 애플리케이션에서 흔히 발생하는 일이다.

In [9]:
# pandas의 설계 목표 중 하나는 누락 데이터를 가능한 한 쉽게 처리할 수 있도록 하는 것이다.

In [10]:
# 예를 들어 pandas 객체의 모든 기술 통계는 누락된 데이터를 베제하고 처리한다.

In [11]:
# pandas 객체에서 누락된 값을 표현하는 방식은 완벽하다고 할 수 없다.

In [12]:
# 산술 데이터에 한해 pandas는 누락된 데이터를 실숫값인 NaN으로 취급한다.

In [13]:
# 이는 누락된 값을 쉽게 찾을 수 있도록 하는 파수병 역할을 한다.

In [14]:
import numpy as np
import pandas as pd
import sqlalchemy as sqla

In [15]:
string_data = pd.Series(["aardvark", "artichoke", np.nan, "avocado"])

In [16]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [17]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [18]:
# pandas에서는 R 프로그래밍 언어에서 결측치를 NA로 취급하는 개념을 차용했다.

In [19]:
# 여기서 결측값은 존재하지 않는(null) 값의 일종으로, 변수(variable) 등이며 값은 존재하는 것이지만, 그 시점에서 아직 정해져 있지 않은 값을 표시한다.

In [20]:
# 분석 애플리케이션에서 NA 데이터는 데이터가 존재하지 않거나, 존재하더라도 데이터를 수집하는 과정 등에서 검출되지 않았음을 의미한다.

In [21]:
# 분석을 위해 데이터를 정제하는 과정에서 결측치 자체를 데이터 수집 과정에서의 실수나 결측치로 인한 잠재적인 편향을 찾아내는 수단으로 인식하는 것은 중요하다.

In [22]:
# 파이썬의 내장 None 값 또한 NA 값으로 취급된다.

In [23]:
string_data[0] = None

In [24]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [25]:
# pandas 프로젝트에서는 결측치를 처리하는 방법을 개선하는 작업이 진행 중이지만 pandas.isnull 같은 사용자 API 함수에서는 성가신 부분을 추상화로 제거했다.

In [26]:
# [표 7-1]에 결측치 처리와 관련된 함수를 정리해두었다. [표 7-1] NA 처리 메서드 페이지 271쪽

In [27]:
# 7.1.1 누락된 데이터 골라내기

In [28]:
# 누락된 데이터를 골라내는 몇 가지 방법이 있는데, pandas.isnull이나 불리언 색인을 사용해 직접 손으로 제거하는 것도 한 가지 방법이다.

In [29]:
# 하지만 dropna를 매우 유용하게 사용할 수 있다.

In [30]:
# Series에 dropna 메서드를 적용하면 Null이 아닌 데이터와 색인값만 들어 있는 Series를 반환한다.

In [31]:
from numpy import nan as NA

In [32]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [33]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [34]:
# 위 코드는 다음과 동일하다.

In [35]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [36]:
# DataFrame 객체의 경우에는 조금 복잡한데, 모두 NA 값인 로우나 컬럼을 제외시키거나 NA 값을 하나라도 포함하고 있는 로우나 컬럼을 제외시킬 수 있다.

In [37]:
# dropna는 기본적으로 NA 값을 하나라도 포함하고 있는 로우를 제외시킨다.

In [38]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [39]:
cleaned = data.dropna()

In [40]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [41]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [42]:
# how="all" 옵션을 넘기면 모두 NA 값인 로우만 제외시킨다.

In [43]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [44]:
# 컬럼을 제외시키는 방법도 동일하게 동작한다. 옵션으로 axis=1을 넘겨주면 된다.

In [45]:
data[4] = NA

In [46]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [47]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [48]:
# DataFrame의 로우를 제외시키는 방법은 시계열 데이터에 주로 사용되는 경향이 있다.

In [49]:
# 몇 개 이상의 값이 들어 있는 로우만 살펴보고 싶다면 thresh 인자에 원하는 값을 넘기면 된다.

In [50]:
df = pd.DataFrame(np.random.randn(7, 3))

In [51]:
df.iloc[:4, 1] = NA

In [52]:
df.iloc[:2, 2] = NA

In [53]:
df

          0         1         2
0 -1.620241       NaN       NaN
1  1.139680       NaN       NaN
2 -0.286809       NaN -0.114703
3  1.385833       NaN -0.947590
4 -0.028245  0.010641  0.429667
5  0.433513 -0.021797 -0.369918
6  2.910312  2.186319 -0.353788

In [54]:
df.dropna()

          0         1         2
4 -0.028245  0.010641  0.429667
5  0.433513 -0.021797 -0.369918
6  2.910312  2.186319 -0.353788

In [55]:
df.dropna(thresh=2)

          0         1         2
2 -0.286809       NaN -0.114703
3  1.385833       NaN -0.947590
4 -0.028245  0.010641  0.429667
5  0.433513 -0.021797 -0.369918
6  2.910312  2.186319 -0.353788

In [56]:
# 7.1.2 결측치 채우기

In [57]:
# 누락된 값을 제외시키지 않고(잠재적으로 다른 데이터도 함께 버려질 가능성이 있다) 데이터 상의 "구멍"을 어떻게든 메우고 싶은 경향이 있다.

In [58]:
# 이 경우 fillna 메서드를 활용하면 되는데, fillna 메서드에 채워 넣고 싶은 값을 넘겨주면 된다.

In [59]:
df.fillna(0)

          0         1         2
0 -1.620241  0.000000  0.000000
1  1.139680  0.000000  0.000000
2 -0.286809  0.000000 -0.114703
3  1.385833  0.000000 -0.947590
4 -0.028245  0.010641  0.429667
5  0.433513 -0.021797 -0.369918
6  2.910312  2.186319 -0.353788

In [60]:
# fillna에 사전값을 넘겨서 각 컬럼마다 다른 값을 채울 수도 있다.

In [61]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0 -1.620241  0.500000  0.000000
1  1.139680  0.500000  0.000000
2 -0.286809  0.500000 -0.114703
3  1.385833  0.500000 -0.947590
4 -0.028245  0.010641  0.429667
5  0.433513 -0.021797 -0.369918
6  2.910312  2.186319 -0.353788

In [62]:
# fillna는 새로운 객체를 반환하지만 다음처럼 기존 객체를 변경할 수도 있다.

In [63]:
_ = df.fillna(0, inplace=True)

In [64]:
df

          0         1         2
0 -1.620241  0.000000  0.000000
1  1.139680  0.000000  0.000000
2 -0.286809  0.000000 -0.114703
3  1.385833  0.000000 -0.947590
4 -0.028245  0.010641  0.429667
5  0.433513 -0.021797 -0.369918
6  2.910312  2.186319 -0.353788

In [65]:
# 재색인에서 사용 가능한 보간 메서드는 fillna 메서드에서도 사용가능하다.

In [66]:
df = pd.DataFrame(np.random.randn(6, 3))

In [67]:
df.iloc[2:, 1] = NA

In [68]:
df.iloc[4:, 2] = NA

In [69]:
df

          0         1         2
0  0.743045  0.358455  0.224726
1 -1.384881  0.734174 -1.214662
2  0.301856       NaN  0.506330
3 -1.149559       NaN -1.552723
4 -0.060081       NaN       NaN
5 -0.474918       NaN       NaN

In [70]:
df.fillna(method="ffill")

          0         1         2
0  0.743045  0.358455  0.224726
1 -1.384881  0.734174 -1.214662
2  0.301856  0.734174  0.506330
3 -1.149559  0.734174 -1.552723
4 -0.060081  0.734174 -1.552723
5 -0.474918  0.734174 -1.552723

In [71]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  0.743045  0.358455  0.224726
1 -1.384881  0.734174 -1.214662
2  0.301856  0.734174  0.506330
3 -1.149559  0.734174 -1.552723
4 -0.060081       NaN -1.552723
5 -0.474918       NaN -1.552723

In [72]:
# 조금만 창의적으로 생각하면 fillna를 이용해서 매우 다양한 일을 할 수 있는데 예를 들어 Series의 평균값이나 중간값을 전달할 수도 있다.

In [73]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [74]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [75]:
# fillna에 대한 설명은 [표 7-2]를 참조하자. [표 7-2] fillna 함수 인자 - 페이지 276

In [76]:
# 7.2 데이터 변형

In [77]:
# 지금까지 데이터를 재배치하는 방법을 알아봤다. 필터링, 정제 및 다른 변형 역시 중요한 연산이다.

In [78]:
# 7.2.1 중복 제거하기

In [79]:
# 여러 가지 이유로 DataFrame에서 중복된 로우를 발견할 수 있다. 예제를 보자.

In [80]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2" : [1, 1, 2, 3, 3, 4, 4]})

In [81]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [82]:
# DataFrame의 duplicated 메서드는 각 로우가 중복인지 아닌지 알려주는 불리언 Series를 반환한다.

In [83]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [84]:
# drop_duplicates는 duplicated 배열이 False인 DataFrame을 반환한다.

In [85]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [86]:
# 이 두 메서드는 기본적으로 모든 컬럼에 적용되며 중복을 찾아내기 위한 부분합을 따로 지정해줄 수도 있다.

In [87]:
# 새로운 컬럼을 하나 추가하고 "k1" 컬럼에 기반해서 중복을 걸러내려면 다음과 같이 한다.

In [88]:
data["v1"] = range(7)

In [89]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [90]:
# duplicated와 drop_duplicates는 기본적으로 처음 발견된 값을 유지한다.

In [91]:
# keep="last" 옵션을 넘기면 마지막으로 발견된 값을 반환한다.

In [92]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [93]:
# 7.2.2 함수나 매핑을 이용해서 데이터 변형하기

In [94]:
# 데이터를 다루다 보면 DataFrame의 컬럼이나 Series, 배열 내의 값을 기반으로 데이터의 형태를 변환하고 싶은 경우가 있다.

In [95]:
# 가상으로 수집한 육류에 대한 다음 정보를 한번 살펴보자.

In [96]:
data = pd.DataFrame({"food" : ["bacon", "pulled pork", "bacon",
                               "Pastrami", "corned beef", "Bacon",
                               "pastrami", "honey ham", "nova lox"],
                     "ounces" : [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [97]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [98]:
# 그리고 해당 육류가 어떤 동물의 고기인지 알려줄 수 있는 컬럼을 하나 추가한다고 가정하고 육류별 동물을 담고 있는 사전 데이터를 아래처럼 작성하자.

In [99]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow", 
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon" 
}

In [100]:
# Series의 map 메서드는 사전류의 객체나 어떤 함수를 받을 수 있는데, 위 데이터에는 육류 이름에 대소문자가 섞여 있는 사소한 문제가 있으므로 
# str.lower 메서드를 사용해서 모두 소문자로 변경한다.

In [102]:
lowercased = data["food"].str.lower()

In [103]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [104]:
data["animal"] = lowercased.map(meat_to_animal)

In [105]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [106]:
# 물론 함수를 넘겨서 같은 일을 수행할 수도 있다.

In [107]:
data["food"].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [108]:
# map 메서드를 사용하면 데이터의 요소별 변환 및 데이터를 다듬는 작업을 편리하게 수행할 수 있다.

In [109]:
# 7.2.3 값 치환하기

In [110]:
# fillna 메서드를 사용해서 누락된 값을 채우는 일은 일반적인 값 치환 작업이라고 볼 수 있다.

In [111]:
# 위에서 살펴봤듯이 map 메서드를 한 객체 안에서 값의 부분집합을 변경하는 데 사용했다면 replace 메서드는 같은 작업에 대해 좀 더 간단하고 유연한 방법을 제공한다.

In [112]:
# 다음 Series 객체를 살펴보자.

In [113]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [114]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [115]:
# -999는 누락된 데이터를 나타내기 위한 값이다.

In [116]:
# replace 메서드를 이용하면 이 값을 pandas에서 인식할 수 있는 NA 값으로 치환한 새로운 Series를 생성할 수 있다. 인자로 inplace=True를 넘기지 않았다면

In [117]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [118]:
# 여러 개의 값을 한 번에 치환하려면 하나의 값 대신 치환하려는 값의 리스트를 넘기면 된다.

In [119]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [120]:
# 치환하려는 값마다 다른 값으로 치환하려면 누락된 값 대신 리스트를 사용하면 된다.

In [121]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [122]:
# 두 개의 리스트 대신 사전을 이용하는 것도 가능하다.

In [123]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [124]:
# Note: data.replace 메서드는 문자열 치환을 항목 단위로 수행하는 data.str.replace와 구별되는데 자세한 내용은 나중에 Series의 문자열 메서드와 함께 알아보겠다.

In [125]:
# 7.2.4 축 색인 이름 바꾸기

In [126]:
# Series의 값들처럼 축 이름 역시 유사한 방식으로 함수나 새롭게 바꿀 값을 이용해서 변환할 수 있다.

In [127]:
# 새로운 자료구조를 만들지 않고 그 자리에서 바로 축 이름을 변경하는 것이 가능하다.

In [128]:
# 다음 예제를 살펴보자.

In [129]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [130]:
# Series와 마찬가지로 축 색인에도 map 메서드가 있다.

In [131]:
transform = lambda x: x[:4].upper()

In [132]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [133]:
# 대문자로 변경된 축 이름을 DataFrame의 index에 바로 대입할 수 있다.

In [134]:
data.index = data.index.map(transform)

In [135]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [137]:
# 원래 객체를 변경하지 않고 새로운 객체를 생성하려면 rename 메서드를 사용한다.

In [138]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [139]:
# 특히 rename 메서드는 사전 형식의 객체를 이용해서 축 이름 중 일부만 변경하는 것도 가능하다.

In [140]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [141]:
# rename 메서드를 사용하면 DataFrame을 직접 복사해서 index와 columns 속성을 갱신할 필요 없이 바로 변경할 수 있다.

In [142]:
# 원본 데이터를 바로 변경하려면 inplace=True 옵션을 넘겨주면 된다.

In [143]:
data.rename(index={"OHIO": "INDIANA"}, inplace=True)

In [144]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [145]:
# 7.2.5 개별화와 양자화

In [146]:
# 연속성 데이터는 종종 개별로 분할하거나 아니면 분석을 위해 그룹별로 나누기도 하는데, 수업에 참여하는 학생 그룹 데이터가 있고, 나이대에 따라 분류한다고 가정하자.

In [147]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [148]:
# 이 데이터를 pandas의 cut 함수를 이용해서 18-25, 26-35, 35-60, 60 이상 그룹으로 나누어보자.

In [149]:
bins = [18, 25, 35, 60, 100]

In [150]:
cats = pd.cut(ages, bins)

In [151]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [152]:
# pandas에서 반환하는 객체는 Categorical이라는 특수한 객체다. 결과에서 보이는 그룹은 pandas.cut으로 계산된 것이다.

In [153]:
# 이 객체는 그룹 이름이 담긴 배열이라고 생각하면 된다.

In [154]:
# 이 Categorical 객체는 codes 속성에 있는 ages 데이터에 대한 카테고리 이름을 categories라는 배열에 내부적으로 담고 있다.

In [155]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [156]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [157]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [158]:
# pd.value_counts(cats)는 pandas.cut 결과에 대한 그룹 수다.

In [159]:
# 간격을 나타내는 표기법은 중괄호로 시작해서 대괄호로 끝나는데 "중괄호 쪽의 값은 포함되지 않고 대괄호 쪽의 값은 포함"하는 간격을 나타낸다.

In [160]:
# right=False를 넘겨서 중괄호 대신 대괄호 쪽이 포함되지 않도록 바꿀 수 있다.

In [161]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [162]:
# labels 옵션으로 그룹의 이름을 직접 넘겨줄 수도 있다.

In [164]:
groups_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [165]:
pd.cut(ages, bins, labels=groups_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [166]:
# 만약 cut 함수에 명시적으로 그룹의 경곗값을 넘기지 않고 그룹의 개수를 넘겨주면 데이터에서 최솟값과 최댓값을 기준으로 균등한 길이의 그룹을 자동으로 계산한다.

In [167]:
# 어떤 균등분포 내에서 4개의 그룹으로 나누는 경우를 생각해보자.

In [168]:
data = np.random.rand(20)

In [169]:
pd.cut(data, 4, precision=2)

[(0.5, 0.74], (0.023, 0.26], (0.023, 0.26], (0.5, 0.74], (0.26, 0.5], ..., (0.74, 0.97], (0.023, 0.26], (0.5, 0.74], (0.26, 0.5], (0.74, 0.97]]
Length: 20
Categories (4, interval[float64, right]): [(0.023, 0.26] < (0.26, 0.5] < (0.5, 0.74] < (0.74, 0.97]]

In [170]:
# precision=2 옵션은 소수점 아래 2자리까지로 제한한다.

In [171]:
# 이를 위한 가장 적합한 함수로 qcut이 있는데 표본 변위치를 기반으로 데이터를 나눠준다.

In [172]:
# cut 함수를 사용하면 데이터의 분산에 따라 각각의 그룹마다 데이터 수가 다르게 나뉘는 경우가 많다.

In [173]:
# qcut은 표준 변위치를 사용하기 때문에 적당히 같은 크기의 그룹으로 나눌 수 있다.

In [174]:
data = np.random.randn(1000) # 정규 분포

In [175]:
cats = pd.qcut(data, 4)

In [176]:
cats

[(-3.6229999999999998, -0.659], (-3.6229999999999998, -0.659], (0.0268, 0.674], (0.674, 3.294], (0.674, 3.294], ..., (-3.6229999999999998, -0.659], (0.0268, 0.674], (-3.6229999999999998, -0.659], (0.0268, 0.674], (0.674, 3.294]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.6229999999999998, -0.659] < (-0.659, 0.0268] < (0.0268, 0.674] < (0.674, 3.294]]

In [177]:
pd.value_counts(cats)

(-3.6229999999999998, -0.659]    250
(-0.659, 0.0268]                 250
(0.0268, 0.674]                  250
(0.674, 3.294]                   250
dtype: int64

In [178]:
# cut 함수와 유사하게 변위치를 직접 지정해줄 수 있다(변위치는 0부터 1까지다).

In [179]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-3.6229999999999998, -1.238], (-3.6229999999999998, -1.238], (0.0268, 1.248], (0.0268, 1.248], (1.248, 3.294], ..., (-1.238, 0.0268], (0.0268, 1.248], (-3.6229999999999998, -1.238], (0.0268, 1.248], (0.0268, 1.248]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.6229999999999998, -1.238] < (-1.238, 0.0268] < (0.0268, 1.248] < (1.248, 3.294]]

In [180]:
# 그룹 분석과 변위치를 다룰 때는 cut과 qcut 함수 같은 이산함수가 특히 더 유용한데 이 내용은 수집과 그룹 연산을 다루는 10장에서 다시 한번 살펴보도록 하겠다.

In [181]:
# 7.2.6 특잇값을 찾고 제외하기

In [182]:
# 배열 연산을 수행할 때는 특잇값을 제외하거나 적당한 값으로 대체하는 것이 중요하다.

In [183]:
# 적절히 분산된 값이 담겨 있는 DataFrame을 살펴보자.

In [184]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [185]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.041586    -0.035244     0.002970     0.020450
std       1.022656     0.988085     0.960245     0.983360
min      -3.225363    -2.962712    -2.744772    -3.414362
25%      -0.744560    -0.706699    -0.632888    -0.614236
50%      -0.042532    -0.053430    -0.009466     0.031562
75%       0.607516     0.666216     0.639846     0.674780
max       3.534163     2.858153     2.807228     3.838490

In [186]:
# 이 DataFrame의 한 컬럼에서 절댓값이 3을 초과하는 값을 찾아내자.

In [187]:
col = data[2]

In [188]:
col[np.abs(col) > 3]

Series([], Name: 2, dtype: float64)

In [189]:
# 절댓값이 3을 초과하는 값이 들어 있는 모든 로우를 선택하려면 불리언 DataFrame에서 any 메서드를 사용하면 된다.

In [190]:
data[(np.abs(data) > 3).any(1)]

C:\Users\ahnjh\AppData\Local\Temp\ipykernel_39048\2969116195.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  data[(np.abs(data) > 3).any(1)]

            0         1         2         3
18   3.494948  0.377184  0.371369 -0.155715
70  -0.128524 -1.491296 -1.279584 -3.057202
81   0.141146 -0.567035  0.214597 -3.414362
230 -0.862496 -0.876636 -0.335610  3.838490
249 -0.277578  1.234763 -0.639522  3.108402
373  3.059979  1.388527 -0.074517 -0.622286
547  0.509619 -0.963223 -0.178850  3.223014
634  0.493151  0.533392  0.524765  3.022396
649  3.534163  1.169254  0.260529  1.309709
778 -3.225363  0.315074 -0.708736 -0.246602
989 -3.064844 -1.258230 -0.911113 -0.190725

In [191]:
# 이 기준대로 쉽게 값을 선택할 수 있으며, 아래 코드로 -3이나 3을 초과하는 값을 -3 또는 3으로 지정할 수 있다.

In [192]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [193]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.042385    -0.035244     0.002970     0.019729
std       1.018275     0.988085     0.960245     0.977799
min      -3.000000    -2.962712    -2.744772    -3.000000
25%      -0.744560    -0.706699    -0.632888    -0.614236
50%      -0.042532    -0.053430    -0.009466     0.031562
75%       0.607516     0.666216     0.639846     0.674780
max       3.000000     2.858153     2.807228     3.000000

In [194]:
# np.sign(data)는 data 값이 양수인지 음수인지에 따라 1이나 -1이 담긴 배열을 반환한다.

In [195]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1 -1.0  1.0 -1.0  1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0 -1.0  1.0  1.0
4 -1.0 -1.0  1.0  1.0

In [196]:
# 7.2.7 치환과 임의 샘플링

In [197]:
# numpy.random.permutaion 함수를 이용하면 Series나 DataFrame의 로우를 쉽게 임의 순서로 재배치할 수 있다.

In [198]:
# 순서를 바꾸고 싶은 만큼의 길이를 permutaion 함수로 넘기면 바뀐 순서가 담긴 정수 배열이 생성된다.

In [199]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [200]:
sampler = np.random.permutation(5)

In [201]:
sampler

array([1, 3, 0, 2, 4])

In [202]:
# 이 배열은 iloc 기반의 색인이나 take 함수에서 사용 가능하다.

In [203]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [204]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

In [205]:
# 치환 없이 일부만 임의로 선택하려면 Series나 DataFrame의 sample 메서드를 사용하면 된다.

In [206]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [207]:
# (반복 선택을 허용하며) 표본을 치환을 통해 생성해내려면 sample에 replace=True 옵션을 넘긴다.

In [208]:
choices = pd.Series([5, 7, -1, 6, 4])

In [209]:
draws = choices.sample(n=10, replace=True)

In [210]:
draws

1    7
3    6
4    4
1    7
3    6
2   -1
3    6
0    5
2   -1
4    4
dtype: int64

In [211]:
# 7.2.8 표시자/더미 변수 계산하기

In [213]:
# 통계 모델이나 머신 러닝 애플리케이션을 위한 또 다른 데이터 변환은 분류값을 "더미"나 "표시자" 행렬로 전환하는 것이다.

In [214]:
# 만약 어떤 DataFrame의 한 컬럼에 k가지 값이 있다면 k개의 컬럼이 있는 DataFrame이나 행렬을 만들고 값으로는 1과 0을 채워 넣을 것이다.

In [215]:
# pandas의 get_dummies가 이를 위한 함수인데 학습자 스스로 새로운 방법을 고안해내는 것도 어렵지 않을 것이다.

In [216]:
# 앞서 살펴본 DataFrame을 다시 살펴보자.

In [217]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})

In [218]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [219]:
# 표시자 DataFrame 안에 있는 컬럼에 접두어를 추가한 후 다른 데이터와 병합하고 싶을 경우가 있다.

In [220]:
# get_dummies 함수의 prefix(접두어) 인자를 사용하면 이를 수행할 수 있다.

In [221]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [223]:
df_with_dummy = df[["data1"]].join(dummies)

In [224]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [225]:
# DataFrame의 한 로우가 여러 카테고리에 속한다면 조금 복잡해지는데, 자세한 내용은 14.2절 "MovieLens의 영화 평점 데이터"에서 살펴보자.

In [229]:
# 우선은 각주 처리하고, 14장이 되면 그때 다시 코드를 적어보겠다.

In [230]:
# names = ["movie_id", "title", "genres"]

In [232]:
# movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
#                         header=None, names=mnames)

In [233]:
# movies[:10]

In [234]:
# 각 장르마다 표시자 값을 추가하려면 약간의 수고를 해야 하는데 먼저 데이터 묶음에서 유일한 장르 목록을 추출해야 한다.

In [235]:
# all_genres = []

In [236]:
# for x in movies.genres:
#   all_genres.extend(x.split("|"))

In [237]:
# genres = pd.unique(all_genres)

In [238]:
# 이제 장르는 아래와 같은 모양이 된다.

In [239]:
# genres

In [240]:
# 이제 표시자 DataFrame을 생성하기 위해 0으로 초기화된 DataFrame을 생성하자.

In [241]:
# zero_matrix = np.zeros((len(movies), len(genres)))

In [242]:
# dummies = pd.DataFrame(zero_matrix, columns=genres)

In [243]:
# 각 영화를 순회하면서 dummies의 각 로우의 항목을 1로 설정한다.

In [244]:
# 각 장르의 컬럼 색인을 계산하기 위해 dummies.columns를 사용하자.

In [245]:
# gen = movies.genres[0]

In [246]:
# gen.split("|")

In [247]:
# dummies.columns.get_indexer(gen.split("|"))

In [248]:
# 그리고 .iloc를 이용해서 색인에 맞게 값을 대입하자.

In [249]:
# for i, gen in enumerate(movies.genres):
#   indices = dummies.columns.get_indexer(gen.split("|"))
#   dummies.iloc[i, indices] = 1

In [250]:
# 그리고 앞에서 한 것처럼 movies와 조합하면 된다.

In [251]:
# movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [252]:
# movies_windic.iloc[0]

In [253]:
# Note : 이보다 더 큰 데이터라면 이 방법으로 다중 멤버십을 갖는 표시자 변수를 생성하는 것은 그다지 빠른 방법은 아니다. 
# 속도를 높이려면 직접 NumPy 배열에 접근하는 저수준의 함수를 작성해서 DataFrame에 결과를 저장하도록 해야 한다.

In [254]:
# get_dummies와 cut 같은 이산함수를 잘 조합하면 통계 애플리케이션에서 유용하게 사용할 수 있다.

In [255]:
np.random.seed(12345)

In [259]:
values = np.random.rand(10)

In [260]:
values

array([0.64247533, 0.71745362, 0.46759901, 0.32558468, 0.43964461,
       0.72968908, 0.99401459, 0.67687371, 0.79082252, 0.17091426])

In [261]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [262]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           1           0
1           0           0           0           1           0
2           0           0           1           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           0           1           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           1           0           0           0           0

In [263]:
# 여기서는 예제 값이 불변하도록 numpy.random.seed 함수를 이용해서 난수 시드값을 지정했다.

In [264]:
# pandas.get_dummies 함수는 나중에 다시 살펴볼 것이다.